server/lhl-final-project/app/views/schedules/show.html.erb

  <tbody>
    <% @schedule.activities.each do |activity| %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."schedule_id" = $1  [["schedule_id", 1]]