server/lhl-final-project/app/controllers/participations_controller.rb

  def show
    @participation = Participation.find(params[:id])
---
SELECT  "participations".* FROM "participations" WHERE "participations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]