server/lhl-final-project/app/controllers/schedules_controller.rb

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]