server/lhl-final-project/app/controllers/trips_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    trip = Trip.find(params[:id])