server/app/views/participations/index.html.erb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."trip_id" = $1  [["trip_id", 1]]
---
              <h1><%= trip.name %></h1>
              <% trip.schedules.each do |schedule| %>

SELECT "participations".* FROM "participations" WHERE "participations"."schedule_id" = $1  [["schedule_id", 3]]
---
                  <tbody>
                    <% schedule.participations.each do |participation| %>

SELECT  "users".* FROM "users" LEFT OUTER JOIN "trips" ON "trips"."user_id" = "users"."id" LEFT OUTER JOIN "schedules" ON "schedules"."trip_id" = "trips"."id" LEFT OUTER JOIN "participations" ON "participations"."schedule_id" = "schedules"."id" LEFT OUTER JOIN "users" "users_participations" ON "users_participations"."id" = "participations"."user_id" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                          <a href="#" class="user-link"></a>
                          <span class="user-subhead"><%= participation.user.first_name %> <%= participation.user.last_name%></span>