server/app/controllers/participations_controller.rb

SELECT  "users".* FROM "users" LEFT OUTER JOIN "trips" ON "trips"."user_id" = "users"."id" LEFT OUTER JOIN "schedules" ON "schedules"."trip_id" = "trips"."id" LEFT OUTER JOIN "participations" ON "participations"."schedule_id" = "schedules"."id" LEFT OUTER JOIN "users" "users_participations" ON "users_participations"."id" = "participations"."user_id" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "participations".* FROM "participations" WHERE "participations"."schedule_id" = $1  [["schedule_id", 3]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."trip_id" = $1  [["trip_id", 1]]
---
  def index

  # @user = User.find(params[:id])
  # @participations = User.left_outer_joins(trips: [:schedules, schedules: [:participations, participations: [:user]]]).find(params[:user_id])
  @participations = User.includes(trips: [:schedules, schedules: [:participations, participations: [:user]]]).find(params[:user_id])

INSERT INTO "participations" ("schedule_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["schedule_id", 2], ["user_id", 2], ["created_at", 2017-04-30 18:56:23 -0700], ["updated_at", 2017-04-30 18:56:23 -0700]]
---
  def create
    @participation = Participation.new(participation_params)
    @participation.user_id = current_user.id
    @participation.save