server/app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.where 'trip_id': params[:trip_id]
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."trip_id" = $1  [["trip_id", 2]]

  def show
    @schedule = Schedule.find(params[:id])
    @participations = @schedule.participations.includes(:user)
    @participation_exists = @schedule.participations.where('user_id' => current_user.id)
    @pending = @participation_exists.count > 0
    @status = @participation_exists.pluck :status
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "participations".* FROM "participations" WHERE "participations"."schedule_id" = $1 AND "participations"."user_id" = $2  [["schedule_id", 1], ["user_id", 2]]
SELECT "schedules".* FROM "schedules"
SELECT COUNT(*) FROM "participations" WHERE "participations"."schedule_id" = $1 AND "participations"."user_id" = $2  [["schedule_id", 1], ["user_id", 2]]
SELECT "participations"."status" FROM "participations" WHERE "participations"."schedule_id" = $1 AND "participations"."user_id" = $2  [["schedule_id", 1], ["user_id", 2]]

  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.save
    @return = Schedule.find @schedule.id
---
INSERT INTO "schedules" ("date", "created_at", "updated_at", "trip_id", "destination_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", Fri, 14 Apr 2017], ["created_at", 2017-04-30 15:39:57 -0700], ["updated_at", 2017-04-30 15:39:57 -0700], ["trip_id", 2], ["destination_name", "Vancouver"]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]