server/app/controllers/search_controller.rb

SELECT "schedules".* FROM "schedules" WHERE (destination LIKE '%ChIJh3uVA7I8h1QR9s_1dehBt0o%')
---
  def show
    @schedule = Schedule.search(params[:id])