server/app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = 2
SELECT "schedules".* FROM "schedules"
---
  def index

    if current_user
      @trips = Trip.where(user_id: current_user)
      @schedules = Schedule.all

INSERT INTO "trips" ("name", "kind", "summary", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "1"], ["kind", "Public"], ["summary", "2"], ["created_at", 2017-04-30 14:01:40 -0700], ["updated_at", 2017-04-30 14:01:40 -0700], ["user_id", 2]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @trip = Trip.new(trip_params)
    @trip.user_id = current_user.id
    @trip.save

    @return = Trip.find @trip.id

UPDATE "trips" SET "kind" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["kind", "PrivatePrivate"], ["updated_at", 2017-05-01 23:45:20 +0000], ["id", 3]]
---
  def update
    respond_to do |format|
      if @trip.update(trip_params)