server/lhl-final-project/app/views/activities/show.html.erb

SELECT "participations".* FROM "participations" WHERE "participations"."activity_id" = $1  [["activity_id", 1]]
---
  <tbody>
    <% @activity.participations.each do |participation| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <td><%= participation.user_id %></td>
      <td><%= participation.user.first_name %></td>