server/lhl-final-project/app/views/trips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <td>
        <%= @trip.user.first_name%>

SELECT "schedules".* FROM "schedules" WHERE "schedules"."trip_id" = $1  [["trip_id", 1]]
---
  <tbody>
    <% @trip.schedules.each do |schedule| %>