server/lhl-final-project/app/views/participations/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      <td><%= @participation.user_id %></td>
      <td><%= @participation.user.first_name %></td>