server/app/views/schedules/show.html.erb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."trip_id" = $1  [["trip_id", 2]]
---
    <div class="col-sm-4">
        <% if @schedule.trip.schedules.length > 1 %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
            <td>
              <a href="#" class="user-link"><%= x.user.first_name %> <%= x.user.last_name %></a>

SELECT "activities".* FROM "activities" WHERE "activities"."schedule_id" = $1  [["schedule_id", 2]]
---
  var eventsArray = [];
  <%@schedule.activities.each do |activity|%>